<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

Загружаем библиотеку

In [1]:
import pandas as pd

Загружаем данные в data

In [2]:
data = pd.read_csv('train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Посмотрим сколько мужчин и женщин распределяленных по классам (Pclass)

In [4]:
data.groupby('Sex').Pclass.value_counts()

Sex     Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: Pclass, dtype: int64

посчитаем мужчин и женщин на борту

In [5]:
data.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

Проверим, данные о том что молодые люди (до 30 лет) выживали чаще, чем пожилые люди (более 60 лет):

In [8]:
sum(data.Survived[data['Age'] <= 30]) > sum(data.Survived[data['Age'] >= 60])

True

Посмотрим доли выживших в каждой группе (молодых и пожилых людей):

In [15]:
pd.DataFrame({'<=30': data.Survived[data['Age'] <= 30].value_counts(normalize=True)[1],'>=60': data.Survived[data['Age'] >= 60].value_counts(normalize=True)[1]
}, index=[0])

       <=30      >=60
0  0.405868  0.269231

Проверим информацию, о том что женщины выживали чаще мужчин:

In [17]:
data.groupby('Sex').agg({'Survived': 'count'})

        Survived
Sex
female       314
male         577

Посмотрим доли выживших среди мужчин и женщин:

In [19]:
pd.DataFrame({'Male': data.Survived[data['Sex'] == 'male'].value_counts(normalize=True)[1],'Female': data.Survived[data['Sex'] >= 'female'].value_counts(normalize=True)[1]
}, index=[0])

       Male    Female
0  0.188908  0.383838

Посмотрим имена у мужчин, найдем часто встречающееся:

In [20]:
data.Name.apply(lambda x: x[:x.find(',')]).value_counts().sort_values(ascending=False)

Andersson    9
Sage         7
Skoog        6
Goodwin      6
Carter       6
            ..
Cribb        1
Fry          1
Ahlin        1
Frolicher    1
Devaney      1
Name: Name, Length: 667, dtype: int64

Выжившие по классам

У богатых пассажиров, шансов выжить было больше:

In [23]:
data.groupby("Pclass")["Survived"].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

Выжившие по возрасту (самый старший, самый молодой и средний возраст выживших)

In [26]:
print(data['Age'].max())
print(data['Age'].min())
print(data['Age'].mean())

80.0
0.42
29.69911764705882

Выжившие по порту посадки

In [24]:
data.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

Посмотрим на данные о выживших женщинах (по возрастным группам) и классе:

In [32]:
data['age_range'] = pd.cut(data['Age'], 7)
data[data['Sex']=='female'].groupby(['age_range', 'Pclass']).mean()['Survived'].unstack()

Pclass                   1         2         3
age_range
(0.34, 11.789]    0.000000  1.000000  0.478261
(11.789, 23.157]  1.000000  1.000000  0.527778
(23.157, 34.526]  0.947368  0.909091  0.481481
(34.526, 45.894]  1.000000  0.857143  0.230769
(45.894, 57.263]  0.928571  0.857143  0.000000
(57.263, 68.631]  1.000000       NaN  1.000000
(68.631, 80.0]         NaN       NaN       NaN